ox-jira.org
#+TITLE: JIRA Backend for Org Export Engine
#+AUTHOR: Stig Brautaset
#+PROPERTY: header-args:emacs-lisp :tangle yes :results silent
* Introduction

  I got tired of exporting Org mode to Markdown and pasting _that_ into this
  [[http://j2m.fokkezb.nl][Markdown to JIRA]] translator, so I'm attempting to write an Org to JIRA
  export backend.

  *This will most likely* only be as complete as I need it to be. I feel I tend
  to use a limited subset of Org's markup, and this backend will likely only
  support that subset---unless I get some contributions.

  The master source is in =ox-jira.org=, and the code sections are /tangled/
  (i.e. extracted) into =ox-jira.el= from it.

* Header

  First come some [[http://www.gnu.org/software/emacs/manual/html_node/elisp/Library-Headers.html][conventional headers]] that libraries tend to include. Cask
  _requires_ them, so I assume they are a good idea.

** Short description

   #+BEGIN_SRC emacs-lisp
     ;;; ox-jira.el --- JIRA Backend for Org Export Engine -*- lexical-binding: j; -*-
   #+END_SRC

** Copyright & License

   I prefer the MIT license because it is short enough to read without toilet
   or tea breaks, and I _think_ I can actually wrap my head around it. (And I
   feel it's important to understand the license of your choice.) However,
   given I've cribbed copiously from `ox-latex.el' I should probably stick
   with the GPL for this work.

   #+BEGIN_SRC emacs-lisp
     ;;; Copyright (C) 2016 Stig Brautaset

     ;; This program is free software: you can redistribute it and/or modify
     ;; it under the terms of the GNU General Public License as published by
     ;; the Free Software Foundation, either version 3 of the License, or
     ;; (at your option) any later version.

     ;; This program is distributed in the hope that it will be useful,
     ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
     ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
     ;; GNU General Public License for more details.

     ;; You should have received a copy of the GNU General Public License
     ;; along with this program.  If not, see <http://www.gnu.org/licenses/>.
   #+END_SRC

** Author

   #+BEGIN_SRC emacs-lisp
     ;;; Author: Stig Brautaset <stig@brautaset.org>
   #+END_SRC

** Keywords

   Define the keywords that can be used to find this package with
   =finder-by-keyword= (=C-h p=).

   #+BEGIN_SRC emacs-lisp
     ;; Keywords: outlines, hypermedia, wp
   #+END_SRC
** Distribution

   #+BEGIN_SRC emacs-lisp
     ;; This file is NOT part of GNU Emacs.
   #+END_SRC
** Version

   #+BEGIN_SRC emacs-lisp
     ;;; Version: 0.1-SNAPSHOT
   #+END_SRC

** Homepage

   #+BEGIN_SRC emacs-lisp
     ;; Homepage: https://github.com/stig/ox-jira.el
   #+END_SRC

** Package Requires

   We requires Org version 8 or above, as the export backend system we use
   was introduced then.

   #+BEGIN_SRC emacs-lisp
     ;; Package-Requires: ((org "8.0"))
   #+END_SRC

** Code

   Lastly a special header to denote that we're done with the header section
   and starting the actual code now.

   #+BEGIN_SRC emacs-lisp
     ;;; Code:
   #+END_SRC

* Code

  Alright! We're done with the introduction. This section contains the actual
  code of our package. I'm excited!

** Require libraries

  The first thing our code needs to do is require the libraries we need. This
  is cargo-culted from `ox-latex.el'.

  #+BEGIN_SRC emacs-lisp
    (eval-when-compile (require 'cl))
    (require 'ox)
    (require 'ox-publish)
  #+END_SRC

** Define Backend

   This is the entry point of our package. The first argument is the name of
   our backend. The second is a map between element types[fn:2] to export and
   the transcode functions to handle them. These are defined in the next
   section. Finally it tells the Org export backend how to create a menu
   entry for us.

   #+BEGIN_SRC emacs-lisp
     (org-export-define-backend 'jira
       '((babel-call . (lambda (&rest args) (org-jira--not-implemented 'babel-call)))
         (body . (lambda (&rest args) (org-jira--not-implemented 'body)))
         (bold . org-jira-bold)
         (center-block . (lambda (&rest args) (org-jira--not-implemented 'center-block)))
         (clock . (lambda (&rest args) (org-jira--not-implemented 'clock)))
         (code . org-jira-code)
         (diary-sexpexample-block . (lambda (&rest args) (org-jira--not-implemented 'diary-sexpexample-block)))
         (drawer . (lambda (&rest args) (org-jira--not-implemented 'drawer)))
         (dynamic-block . (lambda (&rest args) (org-jira--not-implemented 'dynamic-block)))
         (entity . (lambda (&rest args) (org-jira--not-implemented 'entity)))
         (example-block . org-jira-example-block)
         (export-block . (lambda (&rest args) (org-jira--not-implemented 'export-block)))
         (export-snippet . (lambda (&rest args) (org-jira--not-implemented 'export-snippet)))
         (final-output . (lambda (&rest args) (org-jira--not-implemented 'final-output)))
         (fixed-width . org-jira-fixed-width)
         (footnote-definition . (lambda (&rest args) (org-jira--not-implemented 'footnote-definition)))
         (footnote-reference . (lambda (&rest args) (org-jira--not-implemented 'footnote-reference)))
         (headline . org-jira-headline)
         (horizontal-rule . (lambda (&rest args) (org-jira--not-implemented 'horizontal-rule)))
         (inline-babel-call . (lambda (&rest args) (org-jira--not-implemented 'inline-babel-call)))
         (inline-src-block . (lambda (&rest args) (org-jira--not-implemented 'inline-src-block)))
         (inlinetask . (lambda (&rest args) (org-jira--not-implemented 'inlinetask)))
         (italic . org-jira-italic)
         (item . org-jira-item)
         (keyword . (lambda (&rest args) ""))
         (latex-environment . (lambda (&rest args) (org-jira--not-implemented 'latex-environment)))
         (latex-fragment . (lambda (&rest args) (org-jira--not-implemented 'latex-fragment)))
         (line-break . (lambda (&rest args) (org-jira--not-implemented 'line-break)))
         (link . org-jira-link)
         (node-property . (lambda (&rest args) (org-jira--not-implemented 'node-property)))
         (options . (lambda (&rest args) (org-jira--not-implemented 'options)))
         (paragraph . org-jira-paragraph)
         (parse-tree . (lambda (&rest args) (org-jira--not-implemented 'parse-tree)))
         (plain-list . org-jira-plain-list)
         (plain-text . (lambda (plain-text info) plain-text))
         (planning . (lambda (&rest args) (org-jira--not-implemented 'planning)))
         (property-drawer . (lambda (&rest args) (org-jira--not-implemented 'property-drawer)))
         (quote-block . org-jira-quote-block)
         (radio-target . (lambda (&rest args) (org-jira--not-implemented 'radio-target)))
         (section . org-jira-section)
         (special-block . (lambda (&rest args) (org-jira--not-implemented 'special-block)))
         (src-block . org-jira-src-block)
         (statistics-cookie . org-jira-statistics-cookie)
         (strike-through . org-jira-strike-through)
         (subscript . (lambda (&rest args) (org-jira--not-implemented 'subscript)))
         (superscript . (lambda (&rest args) (org-jira--not-implemented 'superscript)))
         (table . (lambda (&rest args) (org-jira--not-implemented 'table)))
         (table-cell . (lambda (&rest args) (org-jira--not-implemented 'table-cell)))
         (table-row . (lambda (&rest args) (org-jira--not-implemented 'table-row)))
         (target . (lambda (&rest args) (org-jira--not-implemented 'target)))
         (timestamp . (lambda (&rest args) (org-jira--not-implemented 'timestamp)))
         (underline . org-jira-underline)
         (verbatim . org-jira-verbatim)
         (verse-block . (lambda (&rest args) (org-jira--not-implemented 'verse-block))))
       :menu-entry
       '(?j "Export to JIRA"
            ((?j "As JIRA buffer" org-jira-export-as-jira))))
   #+END_SRC

** Internal helpers

   Because I'm adding support for things as I find I need it rather than all
   in one go, let's put a big fat red marker in for things we have not
   implemented yet, to avoid missing it.

   #+BEGIN_SRC emacs-lisp
     (defun org-jira--not-implemented (element-type)
       "Replace anything we don't handle yet wiht a big red marker."
       (format "{color:red}Element of type '%s' not implemented!{color}" element-type))
   #+END_SRC

** Transcode Functions

   These functions do the actual translation to JIRA format. For this section
   I've used Atlassian's [[https://jira.atlassian.com/secure/WikiRendererHelpAction.jspa?section=all][Text Formatting Notation Help]] page as a reference.

   #+BEGIN_SRC emacs-lisp
     ;;; Transcode functions
   #+END_SRC

*** Bold

    #+BEGIN_SRC emacs-lisp
      (defun org-jira-bold (bold contents info)
        "Transcode BOLD from Org to JIRA.
      CONTENTS is the text with bold markup. INFO is a plist holding
      contextual information."
        (format "*%s*" contents))
    #+END_SRC

*** Code

    For CODE elements we cannot use the contents, as it is always nil.

    #+BEGIN_SRC emacs-lisp
      (defun org-jira-code (code _contents info)
        "Transcode a CODE object from Org to JIRA.
      CONTENTS is nil.  INFO is a plist used as a communication
      channel."
        (format "{{%s}}" (org-element-property :value code)))
    #+END_SRC

*** Example block

    I often use this for log lines etc. Let's use the JIRA ={noformat}= tags
    for it.

    #+BEGIN_SRC emacs-lisp
      (defun org-jira-example-block (example-block contents info)
        "Transcode an EXAMPLE-BLOCK element from Org to Jira.
      CONTENTS is nil.  INFO is a plist holding contextual
      information."
        (when (org-string-nw-p (org-element-property :value example-block))
          (format "{noformat}\n%s{noformat}"
                  (org-export-format-code-default example-block info))))
    #+END_SRC

