ox-jira.el

;;; ox-jira.el --- JIRA Backend for Org Export Engine -*- lexical-binding: j; -*-

;;; Copyright (C) 2016 Stig Brautaset

;; This program is free software: you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or
;; (at your option) any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with this program.  If not, see <http://www.gnu.org/licenses/>.

;;; Author: Stig Brautaset <stig@brautaset.org>

;; Keywords: outlines, hypermedia, wp

;; This file is NOT part of GNU Emacs.

;;; Version: 0.1-SNAPSHOT

;; Homepage: https://github.com/stig/ox-jira.el

;; Package-Requires: ((org "8.0"))

;;; Code:

(eval-when-compile (require 'cl))
(require 'ox)
(require 'ox-publish)

(org-export-define-backend 'jira
  '((babel-call . (lambda (&rest args) (org-jira--not-implemented 'babel-call)))
    (body . (lambda (&rest args) (org-jira--not-implemented 'body)))
    (bold . org-jira-bold)
    (center-block . (lambda (&rest args) (org-jira--not-implemented 'center-block)))
    (clock . (lambda (&rest args) (org-jira--not-implemented 'clock)))
    (code . org-jira-code)
    (diary-sexpexample-block . (lambda (&rest args) (org-jira--not-implemented 'diary-sexpexample-block)))
    (drawer . (lambda (&rest args) (org-jira--not-implemented 'drawer)))
    (dynamic-block . (lambda (&rest args) (org-jira--not-implemented 'dynamic-block)))
    (entity . (lambda (&rest args) (org-jira--not-implemented 'entity)))
    (example-block . org-jira-example-block)
    (export-block . (lambda (&rest args) (org-jira--not-implemented 'export-block)))
    (export-snippet . (lambda (&rest args) (org-jira--not-implemented 'export-snippet)))
    (final-output . (lambda (&rest args) (org-jira--not-implemented 'final-output)))
    (fixed-width . (lambda (&rest args) (org-jira--not-implemented 'fixed-width)))
    (footnote-definition . (lambda (&rest args) (org-jira--not-implemented 'footnote-definition)))
    (footnote-reference . (lambda (&rest args) (org-jira--not-implemented 'footnote-reference)))
    (headline . org-jira-headline)
    (horizontal-rule . (lambda (&rest args) (org-jira--not-implemented 'horizontal-rule)))
    (inline-babel-call . (lambda (&rest args) (org-jira--not-implemented 'inline-babel-call)))
    (inline-src-block . (lambda (&rest args) (org-jira--not-implemented 'inline-src-block)))
    (inlinetask . (lambda (&rest args) (org-jira--not-implemented 'inlinetask)))
    (italic . org-jira-italic)
    (item . org-jira-item)
    (keyword . (lambda (&rest args) ""))
    (latex-environment . (lambda (&rest args) (org-jira--not-implemented 'latex-environment)))
    (latex-fragment . (lambda (&rest args) (org-jira--not-implemented 'latex-fragment)))
    (line-break . (lambda (&rest args) (org-jira--not-implemented 'line-break)))
    (link . org-jira-link)
    (node-property . (lambda (&rest args) (org-jira--not-implemented 'node-property)))
    (options . (lambda (&rest args) (org-jira--not-implemented 'options)))
    (paragraph . org-jira-paragraph)
    (parse-tree . (lambda (&rest args) (org-jira--not-implemented 'parse-tree)))
    (plain-list . org-jira-plain-list)
    (plain-text . (lambda (plain-text info) plain-text))
    (planning . (lambda (&rest args) (org-jira--not-implemented 'planning)))
    (property-drawer . (lambda (&rest args) (org-jira--not-implemented 'property-drawer)))
    (quote-block . org-jira-quote-block)
    (radio-target . (lambda (&rest args) (org-jira--not-implemented 'radio-target)))
    (section . org-jira-section)
    (special-block . (lambda (&rest args) (org-jira--not-implemented 'special-block)))
    (src-block . org-jira-src-block)
    (statistics-cookie . org-jira-statistics-cookie)
    (strike-through . org-jira-strike-through)
    (subscript . (lambda (&rest args) (org-jira--not-implemented 'subscript)))
    (superscript . (lambda (&rest args) (org-jira--not-implemented 'superscript)))
    (table . (lambda (&rest args) (org-jira--not-implemented 'table)))
    (table-cell . (lambda (&rest args) (org-jira--not-implemented 'table-cell)))
    (table-row . (lambda (&rest args) (org-jira--not-implemented 'table-row)))
    (target . (lambda (&rest args) (org-jira--not-implemented 'target)))
    (timestamp . (lambda (&rest args) (org-jira--not-implemented 'timestamp)))
    (underline . org-jira-underline)
    (verbatim . org-jira-verbatim)
    (verse-block . (lambda (&rest args) (org-jira--not-implemented 'verse-block))))
  :menu-entry
  '(?j "Export to JIRA"
       ((?j "As JIRA buffer" org-jira-export-as-jira))))

(defun org-jira--not-implemented (element-type)
  "Replace anything we don't handle yet wiht a big red marker."
  (format "{color:red}Element of type '%s' not implemented!{color}" element-type))

;;; Transcode functions

(defun org-jira-bold (bold contents info)
  "Transcode BOLD from Org to JIRA.
CONTENTS is the text with bold markup. INFO is a plist holding
contextual information."
  (format "*%s*" contents))

(defun org-jira-code (code _contents info)
  "Transcode a CODE object from Org to JIRA.
CONTENTS is nil.  INFO is a plist used as a communication
channel."
  (format "{{%s}}" (org-element-property :value code)))

(defun org-jira-example-block (example-block contents info)
  "Transcode an EXAMPLE-BLOCK element from Org to Jira.
CONTENTS is nil.  INFO is a plist holding contextual
information."
  (when (org-string-nw-p (org-element-property :value example-block))
    (format "{noformat}\n%s{noformat}"
            (org-export-format-code-default example-block info))))
