ox-jira.org
*** Fixed-width block

    I often use this for short snippets of log lines etc. Let's use the JIRA
    ={noformat}= tags for it.

    #+BEGIN_SRC emacs-lisp
      (defun org-jira-fixed-width (fixed-width contents info)
        "Transcode an FIXED-WIDTH element from Org to Jira.
      CONTENTS is nil.  INFO is a plist holding contextual
      information."
        (format "{noformat}\n%s{noformat}"
                (org-remove-indentation
                 (org-element-property :value fixed-width))))
    #+END_SRC

*** Headline

    Headlines are a little bit more complex. I'm not even attempting to
    support TODO labels and meta-information, just the straight-up text. It
    would be nice to support the six standard levels of headlines JIRA offers
    though.

    Since the headline level is _relative_ rather than absolute, if the
    exporter sees a '** second level' heading before it's seen a '* first
    level' then the '** second level' will think it's a top-level heading.
    That's a bit weird, but there you go.

    #+BEGIN_SRC emacs-lisp
      (defun org-jira-headline (headline contents info)
        "Transcode a HEADLINE element from Org to JIRA.
      CONTENTS is the contents of the headline, as a string.  INFO is
      the plist used as a communication channel."
        (let* ((level (org-export-get-relative-level headline info))
               (title (org-export-data-with-backend
                       (org-element-property :title headline)
                       'jira info)))
          (concat
           (format "h%d. %s\n" level title)
           contents)))
    #+END_SRC

*** Italic

    #+BEGIN_SRC emacs-lisp
      (defun org-jira-italic (italic contents info)
        "Transcode ITALIC from Org to JIRA.
      CONTENTS is the text with italic markup. INFO is a plist holding
      contextual information."
        (format "_%s_" contents))
    #+END_SRC

*** Item

    A list item. This could be bullets, or numeric. This can get quite
    complex. We might not handle every case...

    #+BEGIN_SRC emacs-lisp
      (defun org-jira-item (item contents info)
        "Transcode ITEM from Org to JIRA.
      CONTENTS is the text with item markup. INFO is a plist holding
      contextual information."
        (let* ((parent (org-element-property :parent item))
               (list-type (org-element-property :type parent))
               (checkbox (case (org-element-property :checkbox item)
                           (on "(/) ")
                           (off "(x) ")
                           (trans "(i) "))))
          (concat
           (if (eq list-type 'ordered) "#" "*")
           " "
           checkbox
           contents)))
    #+END_SRC

*** Link

    JIRA supports many types of links. I don't expect we support them all, but
    we must make a token effort. A lot of this code is cribbed from `ox-latex.el'.

    #+BEGIN_SRC emacs-lisp
      (defun org-jira-link (link desc info)
        "Transcode a LINK object from Org to JIRA.

      DESC is the description part of the link, or the empty string.
      INFO is a plist holding contextual information.  See
      `org-export-data'."
        (let* ((type (org-element-property :type link))
               (raw-path (org-element-property :path link))
               (desc (and (not (string= desc "")) desc))
               (path (cond
                      ((member type '("http" "https" "ftp" "mailto" "doi"))
                       (concat type ":" raw-path))
                      ((string= type "file")
                       (org-export-file-uri raw-path))
                      (t raw-path))))
          (cond
           ;; Link with description
           ((and path desc) (format "[%s|%s]" desc path))
           ;; Link without description
           (path (format "[%s]" path))
           ;; Link with only description?!
           (t desc))))
    #+END_SRC

*** Underline

    #+BEGIN_SRC emacs-lisp
      (defun org-jira-underline (underline contents info)
        "Transcode UNDERLINE from Org to JIRA.
      CONTENTS is the text with underline markup. INFO is a plist holding
      contextual information."
        (format "+%s+" contents))
    #+END_SRC

*** Verbatim

    #+BEGIN_SRC emacs-lisp
      (defun org-jira-verbatim (verbatim _contents info)
        "Transcode a VERBATIM object from Org to Jira.
      CONTENTS is nil.  INFO is a plist used as a communication
      channel."
        (format "{{%s}}" (org-element-property :value verbatim)))
    #+END_SRC

*** Paragraph

    One of the most annoying things about JIRA markup is the way it doesn't
    reflow text properly, so any linebreaks becomes hard linebreaks in the
    rendered output. Let's fix that!

    What we need to do is replace any _internal_ newlines (i.e. any not at the
    end of the string) with a space. Regexes to the rescue! I used [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Regexp-Backslash.html#Regexp-Backslash][this
    reference]] to help me with this function.

    #+BEGIN_SRC emacs-lisp
      (defun org-jira-paragraph (paragraph contents info)
        "Transcode a PARAGRAPH element from Org to JIRA.
      CONTENTS is the contents of the paragraph, as a string.  INFO is
      the plist used as a communication channel."
        (replace-regexp-in-string "\n\\([^\']\\)" " \\1" contents))
    #+END_SRC

*** Plain lists

    I make a lot of lists. Let's make sure we handle them! This is very
    simple, as in the JIRA format all the logic is actually _for each item_ in
    the list.

    #+BEGIN_SRC emacs-lisp
      (defun org-jira-plain-list (plain-list contents info)
        "Transcode PLAIN-LIST from Org to JIRA.
            CONTENTS is the text with plain-list markup. INFO is a plist holding
            contextual information."
        contents)
    #+END_SRC

*** Section

    Paragraphs are grouped into sections. I've not found any mention in the
    Org documentation, but it appears to be essential for any export to
    happen. I've essentially cribbed this from `ox-latex.el`[fn:1].

    #+BEGIN_SRC emacs-lisp
      (defun org-jira-section (section contents info)
        "Transcode a SECTION element from Org to JIRA.
      CONTENTS is the contents of the section, as a string.  INFO is
      the plist used as a communication channel."
        contents)
    #+END_SRC

*** Source code block

    JIRA supports formatting for these languages: actionscript, html, java,
    javascript, sql, xhtml, xml. If none of them fits, we can use 'none',
    which I imagine will be a bit like ={noformat}=.

    #+BEGIN_SRC emacs-lisp
      (defun org-jira-src-block (src-block contents info)
        "Transcode a SRC-BLOCK element from Org to Jira.
      CONTENTS holds the contents of the item.  INFO is a plist holding
      contextual information."
        (when (org-string-nw-p (org-element-property :value src-block))
          (let* ((lang (org-element-property :language src-block))
                 (lang (if (member lang '("actionscript" "html" "java" "javascript" "sql" "xhtml" "xml"))
                           lang "none"))
                 (code (org-export-format-code-default src-block info)))
            (format "{code:%s}\n%s{code}"
                    lang
                    code))))
    #+END_SRC

*** Statistics Cookie

    This is updated to show progress of subsequent list of check boxes.

    #+BEGIN_SRC emacs-lisp
      (defun org-jira-statistics-cookie (statistics-cookie _contents _info)
        "Transcode a STATISTICS-COOKIE object from Org to JIRA.
      CONTENTS is nil.  INFO is a plist holding contextual information."
        (format "\\%s" (org-element-property :value statistics-cookie)))
    #+END_SRC

*** Strike-Through

    JIRA call this "deleted text". In my opinion this is rather silly because
    it is obviously there. Org is at least logical in calling it for what it
    is. I suppose JIRA is trying to be semantic here, but outside a diff you
    rather want to look in the revision log for deleted text rather than have
    it clutter up things. Still, it's simple to support, so we might as well
    do it.

    #+BEGIN_SRC emacs-lisp
      (defun org-jira-strike-through (strike-through contents info)
        "Transcode STRIKE-THROUGH from Org to JIRA.
      CONTENTS is the text with strike-through markup. INFO is a plist holding
      contextual information."
        (format "-%s-" contents))
    #+END_SRC

*** Quote block

    #+BEGIN_SRC emacs-lisp
      (defun org-jira-quote-block (quote-block contents info)
        "Transcode a QUOTE-BLOCK element from Org to Jira.
      CONTENTS holds the contents of the block.  INFO is a plist
      holding contextual information."
        (format "{quote}\n%s{quote}" contents))
    #+END_SRC

** End-user functions

   This is our main export function. This can be called from

   #+BEGIN_SRC emacs-lisp
     (defun org-jira-export-as-jira
         (&optional async subtreep visible-only body-only ext-plist)
       "Export current buffer as a Jira buffer.

     If narrowing is active in the current buffer, only export its
     narrowed part.

     If a region is active, export that region.

     A non-nil optional argument ASYNC means the process should happen
     asynchronously.  The resulting buffer should be accessible
     through the `org-export-stack' interface.

     When optional argument SUBTREEP is non-nil, export the sub-tree
     at point, extracting information from the headline properties
     first.

     When optional argument VISIBLE-ONLY is non-nil, don't export
     contents of hidden elements.

     When optional argument BODY-ONLY is non-nil, omit header
     stuff. (e.g. AUTHOR and TITLE.)

     EXT-PLIST, when provided, is a property list with external
     parameters overriding Org default settings, but still inferior to
     file-local settings.

     Export is done in a buffer named \"*Org JIRA Export*\", which
     will be displayed when `org-export-show-temporary-export-buffer'
     is non-nil."
       (interactive)
       (org-export-to-buffer 'jira "*Org JIRA Export*"
         async subtreep visible-only body-only ext-plist))
   #+END_SRC

