ox-jira.org
** Provide

   Announce that =ox-jira= is a feature of the current Emacs.

   #+BEGIN_SRC emacs-lisp
     (provide 'ox-jira)
   #+END_SRC

* Footer

  Now we need to put and end to this malarky. There's a magic comment for
  that too. It looks like this:

  #+BEGIN_SRC emacs-lisp
    ;;; ox-jira.el ends here
  #+END_SRC

  All that does is help people figure out if a file has been truncated. If
  they see that comment, they know they don't have just half the file.
  Weird, huh?

* Footnotes

[fn:2] I got this list of elements from http://orgmode.org/manual/Advanced-configuration.html

[fn:1] Does this mean I have to use the GPL? Is a NOOP function _that you have
to implement to satisfy an interface_ subject to copyright?
